# Reto equipos

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [88]:
df = pd.read_csv('brands.csv')
df_vegan = pd.read_csv('vegan.csv')
df_love = pd.read_csv('love.csv')
df_pepsico = pd.read_csv('pepsico.csv')
df_camila = pd.read_csv('camila.csv')

In [89]:
df = df_brands.dropna()
df_vegan = df_vegan.dropna()
df_love = df_love.dropna()
df_pepsico = df_pepsico.dropna()
df_camila = df_camila.dropna()

In [71]:
df.head()

                Categoría: Todas las categorías
Mes      Constellation Brands: (Estados Unidos)
2004-01                                      26
2004-02                                      36
2004-03                                      19
2004-04                                      38

In [58]:
df_camila.head()

         Categoría: Todas las categorías
Mes      Camila Cabello: (Todo el mundo)
2004-01                                0
2004-02                                0
2004-03                                0
2004-04                                0

In [59]:
df_vegan.head()

        Categoría: Todas las categorías
Mes              vegan: (Todo el mundo)
2004-01                              15
2004-02                              15
2004-03                              14
2004-04                              13

In [60]:
df_pepsico.head()

        Categoría: Todas las categorías
Mes            pepsico: (Todo el mundo)
2004-01                              59
2004-02                              43
2004-03                              61
2004-04                              77

In [90]:
df['brands'] = df['Categoría: Todas las categorías']
df['camila'] = df_camila
df['pepsico'] = df_pepsico
df['vegan'] = df_vegan
df['love'] = df_love
df = df.drop('Categoría: Todas las categorías', axis=1)

In [116]:
df.head()

        brands camila pepsico vegan love
2004-01     26      0      59    15   66
2004-02     36      0      43    15   75
2004-03     19      0      61    14   67
2004-04     38      0      77    13   65
2004-05     19      0      51    14   64

In [119]:
df.corr()

Empty DataFrame
Columns: []
Index: []

In [118]:
m = {'A':[1,2,3], 'B': [2,3,4]}

In [113]:
d = pd.DataFrame(m)

In [114]:
d

   A  B
0  1  2
1  2  3
2  3  4

In [115]:
d.corr()

     A    B
A  1.0  1.0
B  1.0  1.0